#!/bin/bash
clear

echo "---------------------------------------------------------------"
echo "В нек. стране размер подоходного налога зависит от размера дохода. При зарплате <5000 налог не взимается, при зарплате от 5000 до 30000 налог 10%, при з/п свыше 30000 налог 20%. Написать скрипт, кот. запрашивает размер зарплаты и возвращает размер налога."
echo "---------------------------------------------------------------"

echo -n  "Введите зарплату:"
read sallary
echo -e "\v" 

if [[ ${sallary} =~ ^[0-9]+$ ]]
  then 
  	if [ ${sallary} -lt 5000 ]; then
 	 echo "При зарплате ${sallary} налог не взымается"
 	elif [ ${sallary} -ge 5000 ] && [ ${sallary} -le 30000 ]; then
	 echo "При зарплате ${sallary} налог 10%" 
 	elif [ ${sallary} -gt 30000 ];then
	 echo "При зарплате ${sallary} налог 20%"
 	fi
else
  echo "Таких зарплат не бывает"
fi
echo -e "\v---------------------------------------------------------------"
echo "#Написать скрипт кот. получает на входе строку вида '2+3' , а возвращает результат выполнения арифм. операции."
echo "---------------------------------------------------------------"
echo -n "введите значение вида 2+3: "
read a
echo "переменная a=${a}"
echo "1 вариант, скучный, через \$((a)):$((a))"
b=($(echo $a | tr '+' "\n"))
let c=(${b[0]}+${b[1]})
echo "2 вариант, число 1=${b[0]}, число 2=${b[1]}, сумма=$c"

 
echo -e "\v---------------------------------------------------------------"
echo "Have a good day!"
echo "---------------------------------------------------------------"
