#!/bin/bash
clear

echo "---------------------------------------------------------------"
echo "Задание 1. С помощью циклов for, while, until написать скрипт, кот. по очереди выводит на экран все позиционные параметры."
echo "---------------------------------------------------------------"
 
i=1
 echo "цикл for"
  for pp in "$@"
  do echo "параметр $i=$pp"
  ((i++))
 done
echo "---------------------------------------------------------------"
 echo "цикл while"
 i=1
 while [ $i -le $# ]
 do echo ${!i}
 ((i++))
 done

echo "---------------------------------------------------------------"
 i=1
 echo "цикл until"
  until [ -z "$1" ]
  do echo "$i= $1"
  ((i++))
 shift
 done
echo "---------------------------------------------------------------"

echo -e "\v---------------------------------------------------------------"
echo "Have a good day!"
echo "---------------------------------------------------------------"
