#!/bin/bash
clear

echo "---------------------------------------------------------------"
echo "Задание 2. Написать скрипт, кот. находит файл /etc/resolv.conf и выдает количество DNS-серверов."
echo "---------------------------------------------------------------"
ff=$(locate 'resolv.conf')
echo "путь к файлу: $ff"
i=0
while read line; do
  if [[ "$line" == *nameserver* ]] 
  then 
    ((i++))
    echo "$i.$line" 
  fi

done < $ff
echo "ВСЕГО $i сервер\а\ов"

echo -e "\v---------------------------------------------------------------"
echo "Have a good day!"
echo "---------------------------------------------------------------"
